gicking/STM8_headers/SVD/STM8AF61AA.svd
      </registers>
      <interrupt>
        <name>Interrupt_IRQ19</name>
        <description>Interrupt_IRQ19 interrupt</description>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ITC</name>
      <baseAddress>0x50A0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0013</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2ed0</offset>
        <size>7</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ITC</description>
      <groupName>ITC</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>External interrupt control register 1</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PAIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PBIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PDIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>External interrupt control register 2</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PEIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TLIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGKIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_SR</name>
          <description>Reset status register</description>
          <size>8</size>
          <addressOffset>0x0013</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>WWDGF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDGF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILLOPF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIMF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMCF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR1</name>
          <description>Interrupt software priority register 1</description>
          <size>8</size>
          <addressOffset>0x2ED0</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT0SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT1SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT2SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT3SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR2</name>
          <description>Interrupt software priority register 2</description>
          <size>8</size>
          <addressOffset>0x2ED1</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT4SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT5SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT6SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT7SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR3</name>
          <description>Interrupt software priority register 3</description>
          <size>8</size>
          <addressOffset>0x2ED2</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT8SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT9SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT10SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT11SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR4</name>
          <description>Interrupt software priority register 4</description>
          <size>8</size>
          <addressOffset>0x2ED3</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT12SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT13SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT14SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT15SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR5</name>
          <description>Interrupt software priority register 5</description>
          <size>8</size>
          <addressOffset>0x2ED4</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT16SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT17SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT18SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT19SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR6</name>
          <description>Interrupt software priority register 6</description>
          <size>8</size>
          <addressOffset>0x2ED5</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT20SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT21SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT22SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT23SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR7</name>
          <description>Interrupt software priority register 7</description>
          <size>8</size>
          <addressOffset>0x2ED6</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT24SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT25SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT26SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT27SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
